duksubbc/kumhoo_multiport_control/AN2659-IAP_using_user-bootloader.1ch/Project/STM8S_User-Bootloader_example/src/main.c
/**
  ******************************************************************************
  * File main.c
  * Description: Example of implementation of user bootloader (for Application Note AN2659)
  * Author: STMicroelectronics - MCD Prague Application Team
  * Version V2.0.0
  * Date 25/11/2010
  * Product: STM8S
  ******************************************************************************
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * COPYRIGHT 2008 STMicroelectronics
  ******************************************************************************
  */ 

#ifdef _RAISONANCE_
//#pragma SRC is required for assembler code with raisonance
#pragma SRC
#endif

#include "main.h"
#ifdef _RAISONANCE_
//needed by memcpy for raisonance
#include <string.h>
extern int __address__Mem_ProgramBlock; 
extern int __size__Mem_ProgramBlock; 
#endif /*_RAISONANCE_*/


//typedef FAR void (*)(void) TFunction;
typedef void ( *TFunction)(void);
typedef enum {
     FLASH_MEMTYPE_PROG      = (u8)0x00,
     FLASH_MEMTYPE_DATA      = (u8)0x01 
} FLASH_MemType_TypeDef;


//main application code (user reset) - init user code start - to interrupt table reset jump
const TFunction MainUserApplication = (TFunction)MAIN_USER_RESET_ADDR;
//address for GO command
TFunction GoAddress;

//Declare input buffer and its pointer 
u8 DataBuffer[130];
u8 *ReceivedData;
//Declare loaded into RAM
u8 RoutinesInRAM = 0;

#ifdef _COSMIC_
int _fctcpy(char name);
#endif /* _COSMIC*/

void main(void);
void ProcessCommands(void);
u8 GT_Command_Process(void);
u8 RM_Command_Process(void);
u8 WM_Command_Process(void);
u8 GO_Command_Process(void);
u8 CheckTimeout(void);
u8 WriteBuffer(u8 FAR* DataAddress, u8 DataCount);
u8 WriteBufferFlash(u8 FAR* DataAddress, u8 DataCount, FLASH_MemType_TypeDef MemType);
void DeInitBootloader(void);
void protocol_init(void);
u8 Master_ident(u8 IDENT_byte);
void Transmit(u8 Data);
u8 Receive(u8* ReceivedData);
u8 ReceiveAddress(void);
u8 ReceiveCount(u8 max, u8 enablechecksum);
void unlock_PROG(void);
void unlock_DATA(void);
void FLASH_ProgramOptionByte(u16 Address, u8 Data);
void Mem_ProgramBlock(u16 BlockNum, FLASH_MemType_TypeDef MemType, u8 *Buffer);
#if 0
u32 CLK_GetClockFreq(void);
#endif
//**************************************************************************
void main(void){
  sim();               // disable interrupts 
  RoutinesInRAM = 0;

  // Set GPIO for bootloader Pin status detection 
  GPIOD->DDR |= 0x40; 	  // PD5 as Input 
  GPIOD->ODR &= ~0x40; 	  // PD5 as Input 
  GPIOD->DDR &= ~0x40; 	  // PD5 as Input 
  //GPIOD->CR1 |= 0x20; 		// PD2 as Pull Up
  GPIOD->CR2 &= ~0x40;	  // no external interrupt
	
  // Detect if bootloader is enabled (pin in high state)
  if( (GPIOD->IDR & 0x40) != 0x40 ) 
  {
    //if user application is not virgin - valid reset vector jump
    if((*((u8 FAR*)MainUserApplication)==0x82) || (*((u8 FAR*)MainUserApplication)==0xAC))
    {
      //De-init PortD bootloader detection
      GPIOD->ODR=0x00;
      GPIOD->DDR=0x00;
      GPIOD->CR1=0x00;
      GPIOD->CR2=0x00;			
      //reset stack pointer (lower byte - because compiler decreases SP with some bytes)
#ifdef _COSMIC_
     _asm("LDW X,  SP ");
     _asm("LD  A,  $FF");
     _asm("LD  XL, A  ");
     _asm("LDW SP, X  ");
     _asm("JPF $9000");
#elif defined  _IAR_
     asm("LDW X,  SP ");
     asm("LD  A,  $FF");
     asm("LD  XL, A  ");
     asm("LDW SP, X  ");
     asm("JPF $9000");
#else /*_RAISONANCE_*/
#pragma ASM
     LDW X,SP
     LD A,0FFH
     LD XL,A
     LDW SP,X
     JPF 09000H  
#pragma ENDASM
#endif
    }
  }

  //Else start bootloader itself
	
  //De-init PortD bootloader detection
  GPIOD->ODR=0x00;
  GPIOD->DDR=0x00;
  GPIOD->CR1=0x00;
  GPIOD->CR2=0x00;

  /* Set High speed internal clock prescaler */
  CLK->CKDIVR = 0x00;

  /* initialisation of selected protocol peripheral	*/
  protocol_init();
  
  //wait for identification
  if(!Master_ident(IDENT))  
  {
    Transmit(NACK);
		//identification FAILED 
    DeInitBootloader();     // then set back all microcontroller changes to reset values
    //reset stack pointer (lower byte - because compiler decreases SP with some bytes)
#ifdef _COSMIC_ 
   _asm("LDW X,  SP ");
   _asm("LD  A,  $FF");
   _asm("LD  XL, A  ");
   _asm("LDW SP, X  ");
   _asm("JPF $9000");
#elif defined _IAR_
   asm("LDW X,  SP ");
   asm("LD  A,  $FF");
   asm("LD  XL, A  ");
   asm("LDW SP, X  ");
   asm("JPF $9000");
#else /*_RAISONANCE_*/ 
#pragma ASM
   LDW X,SP
   LD A,0FFH
   LD XL,A
   LDW SP,X
   JPF 09000H  
#pragma ENDASM 
#endif 
  }
  //identification SUCESS - copy routines to RAM
#ifdef _COSMIC_  
  _fctcpy('F');
#endif /*_COSMIC_*/ 
#ifdef _RAISONANCE_ 
  memcpy(Mem_ProgramBlock, 
  (void *)&__address__Mem_ProgramBlock,
  (int)&__size__Mem_ProgramBlock); 
#endif /*_RAISONANCE_*/
  RoutinesInRAM = 1;
  unlock_PROG();
  unlock_DATA();
  //send ACK to host
  Transmit(ACK);
  do
  {
    //process commands from host
    ProcessCommands();
    //received GO command - set back all microcontroller changes to reset values
    DeInitBootloader();
    //jump to GO address
    GoAddress();
  }while (1);
	
}//main

void ProcessCommands(void){
  u8 result;
  u8 wait;
  u8 command;
  do
  {
    wait = 8;
    while(wait)
      wait --;
    //init pointer
    ReceivedData = DataBuffer;
  
    //receive data 1-st byte
    if(!Receive(ReceivedData++))
      continue;
  
    //receive data 2-nd byte
    if(!Receive(ReceivedData++))
      continue;
  
    //check if command bytes are complements
    if(DataBuffer[N_COMMAND] != (u8)(~DataBuffer[N_NEG_COMMAND]))
    {
      Transmit(NACK);
      continue;
    }
  
