duksubbc/kumhoo_multiport_control/AN2659-IAP_using_user-bootloader.1ch/Project/STM8S_User-Bootloader_example/src/main.c
    //parse commands
    Transmit(ACK);
    command = DataBuffer[0];
    switch(DataBuffer[0])
    {
      case (GT_Command): result = GT_Command_Process(); break;
      case (RM_Command): result = RM_Command_Process(); break;
      case (GO_Command): result = GO_Command_Process(); break;
      case (WM_Command): result = WM_Command_Process(); break;
    }
  }while( (!result) || (command != GO_Command) ); //until GO command received
}//ProcessCommands

u8 GT_Command_Process(void){
  //send bytes number (Version+commands)=N
  Transmit(Num_GT_Command);
  
  //Send the BL Version Number
  Transmit(Version_Number);
  
  //Send GET command
  Transmit(GT_Command);
  
  //Send Read Memory command
  Transmit(RM_Command);
  
  //Send GO command
  Transmit(GO_Command);
  
  //Send Write Memory command
  Transmit(WM_Command);
  
  //Send Erase Memory command
  Transmit(EM_Command);
  
  //Send Erase Memory command
  Transmit(ACK);
  
  return 1;
}//GT_Command

#if 1
u8 RM_Command_Process(void){
  u8 i;
  u8 FAR* DataAddress;
  u8 Checksum;
  //receive address
  if(!ReceiveAddress())
  {
    Transmit(NACK);// if not valid - NACK
    return 0;
  }
    
  //update address to read from
  DataAddress = *(u8 FAR**)(&DataBuffer[N_ADDR_3]);
  
  //receive count
  if(!ReceiveCount(0xFF, 1))
  {
    Transmit(NACK);// if not valid - NACK
    return 0;
  }
   
  //send data
  Checksum = 0;
  for(i=0; i<=DataBuffer[N_DATACOUNT]; i++)
  {
    Checksum ^= DataAddress[i];
    Transmit(DataAddress[i]);
  }
  return 1;
}//RM_Command
#endif

u8 GO_Command_Process(void){
	u32 Address32;
	u16 Address16;
  //receive address
  if(!ReceiveAddress())
  {
    Transmit(NACK);// if not valid - NACK
    return 0;
  }
  //update GO address 
  Address32 = *(u32*)(&DataBuffer[N_ADDR_3]);
	Address16 = (u16)(Address32 >> 8);
  GoAddress = (TFunction)Address16;
  return 1;
}//GO_Command


u8 WM_Command_Process(void){
  u8 i;
  u8 FAR* DataAddress;
  u8 Checksum;
  u8 DataCount;
  u8 ChecksumByte;
  int ierror = 0;
  
  //receive address
  if(!ReceiveAddress())
  {
    Transmit(NACK);// if not valid - NACK
    return 0;
  }
  
  //update address to write to
  DataAddress = *(u8 FAR**)(&DataBuffer[N_ADDR_3]);
  
  //receive count
  if(!ReceiveCount(BLOCK_SIZE-1, 0))
  {
    Transmit(NACK);// if not valid - NACK
    return 0;
  }  
  
  //receive data
  DataCount = DataBuffer[N_DATACOUNT]; // init count
  Checksum = DataCount;                //init checksum
  for(i=0; i<=DataCount; i++)
  {
    if(!Receive(&DataBuffer[i]))
		{
      ierror = 1;
		}
		//calculate checksum from received bytes
    Checksum ^= DataBuffer[i];
  }
  
  //receive checksum byte
  if(!Receive(&ChecksumByte))
  {
		ierror = 1;
  }
	//check checksum
  if(ChecksumByte != Checksum)
  {
    ierror = 1;
  }
  //if some error occured during data reception
  if (ierror == 1)
  {
    Transmit(NACK); //send error
    return 0;    
  }
  
  //write buffer to memory
  if (!WriteBuffer(DataAddress, DataCount+1))
  {
    Transmit(NACK); //send error
    return 0;    
  }
  //confirm correct writing
  Transmit(ACK);
  return 1;
}//WM_Command

u8 CheckAddress(u32 DataAddress){
  //for Flash
  if ((DataAddress >= FLASH_START) && (DataAddress <= FLASH_END))
    return 1;
  else
    //for EEPROM
    if ((DataAddress >= EEPROM_START) && (DataAddress <= EEPROM_END))
      return 1;
    else
      //for RAM
      if ((DataAddress >= RAM_START) && (DataAddress <= RAM_END))
        return 1;
      else
        //for Option bytes
        if ((DataAddress >= OPTION_START) && (DataAddress <= OPTION_END))
          return 1;
  return 0;
}//CheckAddress

u8 WriteBuffer(u8 FAR* DataAddress, u8 DataCount){
  u8 i;
  
  //for Flash
  if (((u32)DataAddress >= FLASH_START) && (((u32)DataAddress + DataCount - 1) <= FLASH_END))
    return WriteBufferFlash(DataAddress, DataCount, FLASH_MEMTYPE_PROG);
    
  //for EEPROM
  if (((u32)DataAddress >= EEPROM_START) && (((u32)DataAddress + DataCount - 1) <= EEPROM_END))
    return WriteBufferFlash(DataAddress, DataCount, FLASH_MEMTYPE_DATA);
    
  //for RAM
  if (((u32)DataAddress >= RAM_START) && (((u32)DataAddress + DataCount - 1) <= RAM_END))
  {
    for(i=0; i<DataCount; i++)
      DataAddress[i] = DataBuffer[i];
    return 1;
  }
  
  //for Option bytes
  if (((u32)DataAddress >= OPTION_START) && (((u32)DataAddress + DataCount - 1) <= OPTION_END))
  {
    for(i=0; i<DataCount; i++)
    {
       FLASH_ProgramOptionByte((u32)(&DataAddress[i]), DataBuffer[i]);
    }
    return 1;
  }
  
  //otherwise fail
  return 0;
}//WriteBuffer

u8 WriteBufferFlash(u8 FAR* DataAddress, u8 DataCount, FLASH_MemType_TypeDef MemType){
  u32 Address = (u32) DataAddress;
  u8 * DataPointer = DataBuffer;
  u32 Offset;
  //set offset according memory type
  if(MemType == FLASH_MEMTYPE_PROG)
    Offset = FLASH_START;
  else
    Offset = EEPROM_START;
  //program beginning bytes before words
  while((Address % 4) && (DataCount))
  {
    *((PointerAttr u8*) Address) = *DataPointer;
		while( (FLASH->IAPSR & (FLASH_IAPSR_EOP | FLASH_IAPSR_WR_PG_DIS)) == 0);
		Address++;
    DataPointer++;
    DataCount--;
  }
  //program beginning words before blocks
  while((Address % BLOCK_BYTES) && (DataCount >= 4))
  {
		FLASH->CR2 |= (u8)0x40;
		FLASH->NCR2 &= (u8)~0x40;
		*((PointerAttr u8*)Address) = (u8)*DataPointer  ; 	 /* Write one byte - from lowest address*/
		*((PointerAttr u8*)(Address + 1)) = *(DataPointer + 1); /* Write one byte*/
		*((PointerAttr u8*)(Address + 2)) = *(DataPointer + 2); /* Write one byte*/
		*((PointerAttr u8*)(Address + 3)) = *(DataPointer + 3); /* Write one byte - from higher address*/
    while( (FLASH->IAPSR & (FLASH_IAPSR_EOP | FLASH_IAPSR_WR_PG_DIS)) == 0);
		Address    += 4;
    DataPointer+= 4;
    DataCount  -= 4;
  }
  //program blocks
  while(DataCount >= BLOCK_BYTES)
  {
    Mem_ProgramBlock((Address - Offset)/BLOCK_BYTES, MemType, DataPointer);
    Address    += BLOCK_BYTES;
    DataPointer+= BLOCK_BYTES;    
    DataCount  -= BLOCK_BYTES;
  }
  
  //program remaining words (after blocks)
  while(DataCount >= 4)
  {
    FLASH->CR2 |= (u8)0x40;
    FLASH->NCR2 &= (u8)~0x40;
    *((PointerAttr u8*)Address) = (u8)*DataPointer  ; 	 /* Write one byte - from lowest address*/
    *((PointerAttr u8*)(Address + 1)) = *(DataPointer + 1); /* Write one byte*/
    *((PointerAttr u8*)(Address + 2)) = *(DataPointer + 2); /* Write one byte*/
    *((PointerAttr u8*)(Address + 3)) = *(DataPointer + 3); /* Write one byte - from higher address*/
    while( (FLASH->IAPSR & (FLASH_IAPSR_EOP | FLASH_IAPSR_WR_PG_DIS)) == 0);
		Address    += 4;
    DataPointer+= 4;
    DataCount  -= 4;
  }
  
