duksubbc/kumhoo_multiport_control/AN2659-IAP_using_user-bootloader.1ch/Project/STM8S_User-Bootloader_example/src/main.c
  //program remaining bytes (after words)
  while(DataCount)
  {
    *((PointerAttr u8*) Address) = *DataPointer;
    while( (FLASH->IAPSR & (FLASH_IAPSR_EOP | FLASH_IAPSR_WR_PG_DIS)) == 0);
		Address++;
    DataPointer++;
    DataCount--;
  }
  
  return 1;
}//WriteBufferFlash

void DeInitBootloader(void){
  if(RoutinesInRAM)
  {
    /* Lock program memory */
    FLASH->IAPSR = ~0x02;
    /* Lock data memory */
    FLASH->IAPSR = ~0x08;
  }
#if 1	
  /* DeInit I2C */	
  I2C->CR1 = 0x00;
  I2C->CR2 = 0x00;
  I2C->FREQR = 0x00;
  I2C->OARL = 0x00;
  I2C->OARH = 0x00;
  I2C->ITR = 0x00;
  I2C->CCRL = 0x00;
  I2C->CCRH = 0x00;
  I2C->TRISER = 0x02;
#endif	
}//DeInitBootloader

void protocol_init (void) {
	
  #ifdef I2C_protocol
  /* --------------  Initialize the I2C peripheral ------------- */

  I2C->FREQR = 16; 										  // Write new value (16MHz)
  I2C->CR1 = 0x01;											// Enable I2C peripheral
	I2C->CR2 = 0x04;						          // Enable I2C acknowledgement
  I2C->OARL = 0xa2;
  I2C->OARH = 0x40;
  #endif
  #ifdef SPI_Protocol
  /* --------------  Initialize the SPI peripheral ------------- */

  /* Initialize SPI in Slave mode (for IAP-SPI programming) */
  /*FIRST_BIT_MSB*/ 
  /*PRESCALER=2*/ 
  /*CLOCKPOLARITY_LOW*/
  /*CLOCKPHASE_1EDGE*/
  /*SLAVE MODE*/

  SPI->CR1 = (u8)0x00;
          /* Data direction configuration: Fullduplex NSS_HARD */
  SPI->CR2 = (u8)0x00;
    /* CRC polynomial configuration  */
  SPI->CRCPR = (u8)0X07;
          /* Enable the SPI peripheral*/
          SPI->CR1 |= 0x40; 
  #endif /*SPI init end*/
  #ifdef UART1_Protocol
  /* --------------  Initialize the UART peripheral ---------------- */

  u32 BaudRate_Mantissa, BaudRate_Mantissa100 = 0;	
  
  /* Set Rx/Tx for UART uses*/

  /* Pull-Up */
  //GPIOD->CR1 |= (u8)0x40;
  //GPIOC->CR1 |= (u8)0x02;		
  
  /* UART1 Enable */
  UART1->CR1 &= (u8)(~0x20); 
           
  /* Set 9bit data + Parity Control bit with Even parity */
  UART1->CR1 |= (u8)  0x14;
          
  /* UART RXTX enable */
  UART1->CR2 |= (u8)  0x0C;
  
  //Force BR to 9600 
  UART1->BRR2 = 0x02;
  UART1->BRR1 = 0x68;

  #endif
  #ifdef UART2_Protocol
  /* --------------  Initialize the UART peripheral ---------------- */	
  u32 BaudRate_Mantissa, BaudRate_Mantissa100 = 0;	

  /* Set Rx/Tx for UART2 uses*/

  /* Pull-Up */
  GPIOD->CR1 |= (u8)0x40;
  GPIOC->CR1 |= (u8)0x02;		

  /* UART2 Enable */
  UART2->CR1 &= (u8)(~0x20); 
   
  /* Set 9bit data + Parity Control bit with Even parity */
  UART2->CR1 |= (u8)  0x14;

  /* UART RXTX enable */
  UART2->CR2 |= (u8)  0x0C;

  //Force BR to 9600 
  UART2->BRR2 = 0x02;
  UART2->BRR1 = 0x68;
  #endif
  #ifdef UART3_Protocol
  /* --------------  Initialize the UART peripheral ---------------- */
          
  /* Set Rx/Tx for UART3 uses*/

  /* Pull-Up */
  GPIOD->CR1 |= (u8)0x40;
  GPIOC->CR1 |= (u8)0x02;		
          
  /* UART3 Enable */
  UART3->CR1 &= (u8)(~0x20); 
           
  /* Set 9bit data + Parity Control bit with Even parity */
  UART3->CR1 |= (u8)  0x14;
          
  /* UART RXTX enable */
  UART3->CR2 |= (u8)  0x0C;
          
          //Force BR to 9600 
  UART3->BRR2 = 0x02;
          UART3->BRR1 = 0x68;
  #endif
}

void Transmit(u8 Data){
#ifdef SPI_Protocol
    u8 sr;						// working copy of SPI_SR register
#endif
#if defined(UART1_Protocol) || defined(UART2_Protocol) || defined(UART3_Protocol)
    u8 sr;
#endif
#ifdef I2C_protocol
    u8 sr1;						// working copy of I2C_SR1
    u8 sr3;						// working copy of I2C_SR3 

    //Wait for Slave address Match
    sr1 = I2C->SR1;
    while(!(sr1 & 0x02/*ADDR*/)) sr1 = I2C->SR1;
    //Clear Address matched Flag
    sr3 = I2C->SR3;
    sr1 = I2C->SR1;

    //Wait for TX buffer empty
    while(!(sr1 & 0x80/*TxE*/)) sr1 = I2C->SR1;		
    //write Data in I2C data register
    I2C->DR = Data ;
#endif
#ifdef SPI_Protocol
    sr = SPI->SR;
    SPI->DR = Data ; /* Write in the DR register the data to be sent*/
    while(!(sr & 0x01/*RxNE*/)) sr = SPI->SR;
    SPI->DR = 0x00;
#endif
#ifdef UART1_Protocol
    //wait for Tx empty
    sr = UART1->SR;
    while(!(sr & 0x80/*TxNE*/)) sr = UART1->SR;
    //send data
    UART1->DR = Data;
    //wait for transmission complete
    sr = UART1->SR;
    while(!(sr & 0x40/*TxNE*/)) sr = UART1->SR;
#endif
#ifdef UART2_Protocol
    //wait for Tx empty
    sr = UART2->SR;
    while(!(sr & 0x80/*TxNE*/)) sr = UART2->SR;
    //send data
    UART2->DR = Data;
    //wait for transmission complete
    sr = UART2->SR;
    while(!(sr & 0x40/*TxNE*/)) sr = UART2->SR;
#endif
#ifdef UART3_Protocol
    //wait for Tx empty
    sr = UART3->SR;
    while(!(sr & 0x80/*TxNE*/)) sr = UART3->SR;
    //send data
    UART3->DR = Data;
    //wait for transmission complete
    sr = UART3->SR;
    while(!(sr & 0x40/*TxNE*/)) sr = UART3->SR;
#endif
}//Transmit

u8 Receive(u8* ReceivedData){
	
#ifdef SPI_Protocol
    u8 sr;						// working copy of SPI_SR register
#endif	
#if defined(UART1_Protocol) || defined(UART2_Protocol) || defined(UART3_Protocol)
    u8 sr;						// working copy of SPI_SR register
#endif
#ifdef I2C_protocol
    u8 sr1;						// working copy of I2C_SR1
    u8 sr2;						// working copy of I2C_SR2
    u8 sr3;						// working copy of I2C_SR3
    
    //Wait for Slave address Match
    sr1 = I2C->SR1;
    while(!(sr1 & 0x02/*ADDR*/)) sr1 = I2C->SR1;					
                                    
    //Clear Address matched Flag
    sr3 = I2C->SR3;
    sr1 = I2C->SR1;
    
    //Wait for Data received
    while( !(sr1 & 0x40/*RDATA*/)) sr1 = I2C->SR1;		

    //check if overrun or parity error
    sr2 = I2C->SR2;
    if((sr2 & 0x08/*OVR*/)||(sr2 & 0x02/*ARLO*/)||(sr2 & 0x01/*BERR*/))
    {
        //receive data to clear error
        * ReceivedData = (u8)I2C->DR;
        //send NACK to host
        Transmit(NACK);
        //and return error
        return 0;
    }	
    //store received data 
    * ReceivedData = (u8)I2C->DR ;
    sr1 = I2C->SR1;
    while(!(sr1 & 0x10/*STOPF*/)) sr1 = I2C->SR1 ;
    /* Clear STOP flag */
    sr1 = I2C->SR1;
    I2C->SR2 &= ~0x02 ; //Clear Stop
    return 1;
#endif
#ifdef SPI_Protocol
    //Wait for data received flag
    sr = SPI->SR;
    while(!(sr & 0x01/*RxNE*/)) sr = SPI->SR;					
    //Clear flag
    sr = SPI->SR;
    * ReceivedData = SPI->DR;
    sr = SPI->SR;	
#endif	
#ifdef UART1_Protocol
    //wait for Rx full
    sr = UART1->SR;
    while(!(sr & 0x20 /*RXNE*/)) sr = UART1->SR ;
    //check if overrun or parity error
    if((sr & 0x08/*OR*/)||(sr & 0x01/*PE*/))
    {
    //receive data to clear error
    *ReceivedData = UART1->DR ;
    //send NACK to host
    Transmit(NACK);
    //and return error
    return 0;
    }
    //receive data
    *ReceivedData = UART1->DR;
    //and return no error
    return 1;
#endif
#ifdef UART2_Protocol
    //wait for Rx full
    sr = UART2->SR;
    while(!(sr & 0x20 /*RXNE*/)) sr = UART2->SR ;
    //check if overrun or parity error
    if((sr & 0x08/*OR*/)||(sr & 0x01/*PE*/))
    {
    //receive data to clear error
    *ReceivedData = UART2->DR ;
    //send NACK to host
    Transmit(NACK);
    //and return error
    return 0;
    }
    //receive data
    *ReceivedData = UART2->DR;
    //and return no error
    return 1;
#endif
#ifdef UART3_Protocol
    //wait for Rx full
    sr = UART3->SR;
    while(!(sr & 0x20 /*RXNE*/)) sr = UART3->SR ;
    //check if overrun or parity error
    if((sr & 0x08/*OR*/)||(sr & 0x01/*PE*/))
    {
    //receive data to clear error
    *ReceivedData = UART3->DR ;
    //send NACK to host
    Transmit(NACK);
    //and return error
    return 0;
    }
    //receive data
    *ReceivedData = UART3->DR;
    //and return no error
    return 1;
#endif
}//Receive

