duksubbc/kumhoo_multiport_control/AN2659-IAP_using_user-bootloader.1ch/Project/STM8S_User-Bootloader_example/src/main.c
u8 Master_ident(u8 IDENT_byte){
    u8 master_ident;
    Receive(&master_ident);
    if (master_ident == IDENT_byte) 
    {
          return 1;	
    } 
    return 0;
}//Master_ident

u8 ReceiveAddress(void)
{
  u8 result = 1;
  
  //receive address (4 bytes : Byte3: MSB , Byte6: LSB)
  if(!Receive(ReceivedData++))
    result = 0;
  if(!Receive(ReceivedData++))
    result = 0;
  if(!Receive(ReceivedData++))
    result = 0;
  if(!Receive(ReceivedData++))
    result = 0;
    
  //receive checksum (from 4 bytes : Byte3: MSB - Byte6: LSB)
  if(!Receive(ReceivedData++))
    result = 0;
  
  //check checksum
  if(*(--ReceivedData) ^ *(--ReceivedData) ^ *(--ReceivedData) ^ *(--ReceivedData) ^ *(--ReceivedData))
    result = 0;
  //set back data pointer
  ReceivedData += 5;
  
  //check if address is valid
  //if(!CheckAddress(*((u32*) &DataBuffer[N_ADDR_4]) ))
    //result = 0;
  
  //if some error occured
  if (!result)
    return 0;
  
  //confirm correct reception
  Transmit(ACK);
  return 1;
}//ReceiveAddress

u8 ReceiveCount(u8 max, u8 enablechecksum)
{
  bool result = 1;
  
  //receive count
  if(!Receive(ReceivedData))
    result = 0;
    
  //check maximum value
  if(!((*ReceivedData++) <= max))
    result = 0;
 
 
 //receive checksum if enabled
  if (enablechecksum)
  {
    //receive checksum
    if(!Receive(ReceivedData++))
      result = 0;
      
    //check checksum
    if((*(--ReceivedData) ^ *(--ReceivedData)) != 0xFF)
      result = 0;
    //set back data pointer
    ReceivedData += 2;
  }
	
	//confirm correct reception - if required
  if (enablechecksum)
    Transmit(ACK);
  
  return result;
}//ReceiveCount

void unlock_PROG(void)
{
  //Unlock PROG memory
  FLASH->PUKR = 0x56;
  FLASH->PUKR = 0xAE;
}
	
void unlock_DATA(void)
{
 //Unlock DATA memory
  FLASH->DUKR = 0xAE; /* Warning: keys are reversed on data memory !!! */
  FLASH->DUKR = 0x56;
}
#ifdef _COSMIC_
#pragma section (FLASH_CODE)
#endif /* _COSMIC */

#ifdef _IAR_
#pragma location = "FLASH_CODE"
#endif /* _IAR_ */

#ifdef _RAISONANCE_
void Mem_ProgramBlock(u16 BlockNum, FLASH_MemType_TypeDef MemType, u8 *Buffer) inram
#else
void Mem_ProgramBlock(u16 BlockNum, FLASH_MemType_TypeDef MemType, u8 *Buffer)
#endif /*_RAISONANCE_*/
{
    u16 Count = 0;
    u32 StartAddress = 0;
    u16 timeout = (u16)0x6000;
 
 /* Set Start address wich refers to mem_type */
    if (MemType == FLASH_MEMTYPE_PROG)
    {
        StartAddress = FLASH_START;
    }
    else
    {
        StartAddress = EEPROM_START;
    }

    /* Point to the first block address */
    StartAddress = StartAddress + ((u32)BlockNum * BLOCK_SIZE);

    /* Standard programming mode */ 
    FLASH->CR2 |= (u8)0x01;
    FLASH->NCR2 &= (u8)~0x01;
    
    /* Copy data bytes from RAM to FLASH memory */
    for (Count = 0; Count < BLOCK_SIZE; Count++)
    {
        *((PointerAttr u8*)StartAddress + Count) = ((u8)(Buffer[Count]));
    }

#if defined (STM8S208) || defined(STM8S207) || defined(STM8S007) || defined(STM8S105) || \
    defined(STM8S005) || defined(STM8AF52Ax) || defined(STM8AF62Ax) || defined(STM8AF626x)
    if (MemType == FLASH_MEMTYPE_DATA)
    {
        /* Waiting until High voltage flag is cleared*/
        while ((FLASH->IAPSR & 0x40) != 0x00 || (timeout == 0x00))
        {
            timeout--;
        }
    }
 #endif /* STM8S208, STM8S207, STM8S105, STM8AF52Ax, STM8AF62Ax, STM8AF262x */
}

#ifdef _COSMIC_
#pragma section ()
#endif /* __COSMIC__ */

void FLASH_ProgramOptionByte(u16 Address, u8 Data){
  u8 flash_iapsr;	
  /* Enable write access to option bytes */
  FLASH->CR2 |= (u8)0x80;
  FLASH->NCR2 &= (u8)(~0x80);

  /* Program option byte and his complement */
  *((NEAR u8*)Address) = Data;
  *((NEAR u8*)(Address + 1)) = (u8)(~Data);

#if defined (STM8S208) || defined(STM8S207) || defined(STM8S007) || defined(STM8S105) || \
    defined(STM8S005) || defined(STM8AF52Ax) || defined(STM8AF62Ax) || defined(STM8AF626x) 
	  flash_iapsr = FLASH->IAPSR ;
		while (!(flash_iapsr & 0x41)) flash_iapsr = FLASH->IAPSR ;
#else /*STM8S103, STM8S903*/
	  flash_iapsr = FLASH->IAPSR ;
		while (!(flash_iapsr & 0x05)) flash_iapsr = FLASH->IAPSR ;
#endif /* STM8S208, STM8S207, STM8S105, STM8AF52Ax, STM8AF62Ax, STM8AF262x */

  /* Disable write access to option bytes */
  FLASH->CR2 &= (u8)(~0x80);
  FLASH->NCR2 |= (u8)0x80;
}

#if 0
u32 CLK_GetClockFreq(void)
{
    uc8 HSIDivFactor[4] = {1, 2, 4, 8}; /* Holds the different HSI Dividor factors */
    u32 clockfrequency = 0;
    u8 tmp = 0, presc = 0;
    tmp = (u8)(CLK->CKDIVR & 0x18);
    tmp = (u8)(tmp >> 3);
    presc = HSIDivFactor[tmp];
    clockfrequency = 16000000 / presc;
    return((u32)clockfrequency);
}
#endif
//**************************************************************************

